In [1]:
import pandas as pd

In [2]:
df1 = pd.DataFrame(
    {
        'id': [1, 2, 3],
        'name': ['Alice', 'Bob', 'John']
    }
)
df2 = pd.DataFrame(
    {
        'id': [4, 5, 6, 7],
        'name': ['Jane', 'Adam', 'Josh', 'Another']
    }
)

In [3]:
df1

   id   name
0   1  Alice
1   2    Bob
2   3   John

In [4]:
df2

   id     name
0   4     Jane
1   5     Adam
2   6     Josh
3   7  Another

In [5]:
pd.concat([df1,df2])

   id     name
0   1    Alice
1   2      Bob
2   3     John
0   4     Jane
1   5     Adam
2   6     Josh
3   7  Another

In [7]:
pd.concat([df1,df2],axis=1)

    id   name  id     name
0  1.0  Alice   4     Jane
1  2.0    Bob   5     Adam
2  3.0   John   6     Josh
3  NaN    NaN   7  Another

In [8]:
df1 = pd.DataFrame(
    {
        'id': [1, 2, 3],
        'name': ['Alice', 'Bob', 'John']
    }
)
df2 = pd.DataFrame(
    {
        'id': [2, 3, 4],
        'name': ['Bob1', 'John', 'Unknown'],
        'score': [50, 60, 70]
    }
)
df1

   id   name
0   1  Alice
1   2    Bob
2   3   John

In [14]:
result = pd.merge(df1, df2, on='id', suffixes=[None, '_other'])
result

   id  name name_other  score
0   2   Bob       Bob1     50
1   3  John       John     60

In [15]:
result=pd.merge(df1,df2,on='id')
result.columns=['id','name','name_other','score']
result

   id  name name_other  score
0   2   Bob       Bob1     50
1   3  John       John     60

In [16]:
df1 = pd.DataFrame(
    {
        'id': [1, 2, 3],
        'name': ['Alice', 'Bob', 'John']
    }
)
df2 = pd.DataFrame(
    {
        'id': [2, 3, 4],
        'score': [50, 60, 70]
    }
)
df1

   id   name
0   1  Alice
1   2    Bob
2   3   John

In [17]:
df2

   id  score
0   2     50
1   3     60
2   4     70

In [18]:
result = pd.merge(df1, df2, on='id', how='left')
result

   id   name  score
0   1  Alice    NaN
1   2    Bob   50.0
2   3   John   60.0

In [19]:

result = pd.merge(df1, df2, on='id', how='right')
result

   id  name  score
0   2   Bob     50
1   3  John     60
2   4   NaN     70

In [20]:
result = pd.merge(df1, df2, on='id', how='outer')
result

   id   name  score
0   1  Alice    NaN
1   2    Bob   50.0
2   3   John   60.0
3   4    NaN   70.0

In [21]:

result.sort_values(by=['score'])

   id   name  score
1   2    Bob   50.0
2   3   John   60.0
3   4    NaN   70.0
0   1  Alice    NaN

In [22]:
df1

   id   name
0   1  Alice
1   2    Bob
2   3   John

In [23]:
df2

   id  score
0   2     50
1   3     60
2   4     70

In [24]:

res_temp = pd.merge(df1, df2, on='id', how='left')
res_temp

   id   name  score
0   1  Alice    NaN
1   2    Bob   50.0
2   3   John   60.0

In [25]:
res_temp[res_temp['score'].isna()].drop(columns=['score'])

   id   name
0   1  Alice

In [27]:
numbers = [1, 2, 3, 4, 5, 6, 7, 8]
a=numbers[1::2]
print(a)

[2, 4, 6, 8]

In [34]:
my_tuple = (1, 2, 3)
my_list=list(my_tuple)
my_list.append(5)
my_tuple=tuple(my_list)
my_tuple

(1, 2, 3, 5)

In [44]:
my_dict = {'a': 10, 'b': 25, 'c': 5}
max_key=max(my_dict,key=my_dict.get)
max_values=my_dict[max_key]
print(max_key)

b

list va tuple o'rtasidagi farq nimada?
1.Mutability 
2.sintaksis
3.